/**************************************************************************
* @copyright    :Copyright(C), 2019, pxf, person.
* @file         :test.h
* @author       :pxf
* @version      :v1.0
* @date         :2019/01/06 16:57:36
* @brief        :
* @others       :
* @history      :190106 pxf 初建立
***************************************************************************/

#ifndef TEST_H_
#define TEST_H_


/*名称 :test()
* 输入 :无
* 输出 :无
* 其他 :无
***********************************************/
void test(void);


#endif /*TEST_H_*/

/**************************** Copyright(C) pxf ****************************/
