/**************************************************************************
* @copyright    :Copyright(C), 2018, pxf, person.
* @file         :casSch.h
* @author       :pxf
* @version      :v1.0
* @date         :2018/08/27 22:43:29
* @brief        :组件casSch 输入类、组件类、输出类数据类型声明头文件
* @others       :
* @history      :180827 pxf 初次建立
***************************************************************************/

#ifndef CASSCH_H_
#define CASSCH_H_

#include "..\..\01_std\std.h"
#include "..\..\06_cas\casSch\casSch.h"
#include "casSchCfg.h"
#include "casSchErrCode.h"

/***********************************************************
* 组件初始化
***********************************************************/
/*组件输入初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 vfbIcasSchInit(void);

/*组件初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 casSchInit(void);

/*组件输出初始化
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
int16 vfbOcasSchInit(void);

/*管理组件初始化外部声明
* 输入: 无
* 输出: int16 0-成功,-1-失败
***********************************************/
extern int16 vfbMcasSchInit(void);


/***********************************************************
* 组件调度
***********************************************************/
/*组件进行调度
* 输入: 无
* 输出: 无
***********************************************/
void casSchSch(void);


/***********************************************************
* 组件输入类通用数据类型
***********************************************************/


/***********************************************************
* 组件输出类通用数据类型
***********************************************************/


/***********************************************************
* 组件输出类定义
***********************************************************/
/*组件输出类声明
***********************************************/
CL(vfbOcasSch){
    hvfbOcasSch self;
    hvfbOcasSch (*init)(hvfbOcasSch cthis);

    // 组件调度参数
    schParam schParam;

    // 示例组件输出类功能函数
    //void (*example)(hvfbOcasSch t);
    //TODO
};

/*组件输出类外部接口声明
* 命名方式: 存放类+实际类+实际类功能
***********************************************/
//extern void vfbMcasSch_vfbOcasSch_example(hvfbOcasSch t);
//TODO

/*组件输出类实例
***********************************************/
extern vfbOcasSch vfbOcasSchA;


/***********************************************************
* 组件类定义
***********************************************************/
/*组件状态机状态
* 有两个状态init/default，状态list不显示，默认给出
* 状态list需根据实际应用进行重写，list修改后相应状态函数得对应修改
***********************************************/
#define SM_CASSCH_STA_LIST(_) \
    _(smcasSch, sta1)\
    _(smcasSch, sta2)

/*组件状态机定义
***********************************************/
SMDC(smcasSch, SM_CASSCH_STA_LIST)
{
    sta next;
    //TODO

    // 注入组件类
    void *casSch;
};


/*组件类声明
***********************************************/
CL(casSch){
    hcasSch self;
    hcasSch (*init)(hcasSch cthis, hstaAct smcasSch, hvfbOcasSch vfbOcasSch);

    // 组件运行状态机
    smcasSchRec smcasSchRec;
    hstaAct smcasSch;

    // 组件运行功能函数
    void (*run)(hcasSch t);
    //void (*example)(hcasSch t);
    //TODO

    // 注入组件输出类
    INJ(vfbOcasSch, vfbOcasSch);
};

/*异步调度功能函数
* 命名方式: 存放类+实际类+实际类功能
***********************************************/
//void casSch_abi_example(void);
//TODO

/*组件类实例
***********************************************/
extern casSch casSchA;


/***********************************************************
* 组件输入类定义
***********************************************************/
/*组件输入类声明
***********************************************/
CL(vfbIcasSch){
    hvfbIcasSch self;
    hvfbIcasSch (*init)(hvfbIcasSch cthis, hcasSch casSch);

    //void (*example)(hvfbIcasSch t);
    //TODO

    // 注入组件类
    INJ(casSch, casSch);
};

/*组件输入类实例
***********************************************/
extern vfbIcasSch vfbIcasSchA;


#endif

/**************************** Copyright(C) pxf ****************************/
